{
  "title": "Docs Overview",
  "description": [
    "Documentation is made up of `.json` and `.md` files in the `/docs/data` directory. All existing documentation SHOULD be edited for a new project, or whenever anything changes.",
    "Browncoat ships with some default documentation (see top level navigation and `scss` subsection). Documentation functionality MUST be modified by editing `/src/js/docs.js` (and required files). Documentation specific styling MUST be modified by editing `/src/scss/docs.scss`. Documentation styles will also change as styles are developed for the project."
  ],
  "sections": [
    {
      "key": false,
      "title": "Existing Pages",
      "nav": false,
      "description": [
        "URL paths are resolved in `/src/js/docs.js` by fetching the corresponding data files. Data files are broken up in two parts an `.md` file and a `.json` file. They are found in `/docs/data`. Content changes and code sample changes MUST be made in these files.",
        "For example: the path `/scss/bits` will tell browncoat docs to get `/data/scss/bits.json` and `/data/scss/bits.md` and generate our doc page.",
        "This will work for all paths defined in `/docs/data/_main.json` (both `projectNav` and `sectionNavs` items)."
      ],
      "file": "/docs",
      "display": false
    },
    {
      "key": "main",
      "title": "_main.json",
      "nav": "Main JSON file",
      "description": [
        "Sets up the browncoat docs. See anotated file below."
      ],
      "file": "/docs/data/_main.json",
      "display": false
    },
    {
      "key": "json",
      "title": "Anatomy of a .json file",
      "nav": "JSON Files",
      "description": [
        "`.json` files contain the page title, description, and sections. Each section is displayed as a box within the page. They have a title, description, footer, optional code sample, and optional rendered code sample. Code samples are stored in the corresponding `.md` file.",
        "For example: This file `/docs/data/docs.json` has a section (this section) which asks for the code sample \"json\" from `/docs/data/docs.md`. The anotated json sample below is the result."
      ],
      "file": "/docs/data/**/*.json",
      "display": false
    },
    {
      "key": "md",
      "title": "Anatomy of an .md file",
      "nav": "Markdown Files",
      "description": [
        "`.md` files contain code samples. Code samples MUST start with a key using 3 hashtags (#). They MUST be separated by three dashes (-). Sample code must be surrounded by 3 backticks (`) on either end with an optional language specificed."
      ],
      "file": "/docs/data/_main.json",
      "display": false
    }
  ]
}
